Repository: Hany-Hagar/daftarni
Catalog: lib/l10n/intl_*.arb
Languages: ar

# iconPickerTitle
source: Pick an Icon
ar: اختر أيقونة

source: Search icon
ar: ابحث عن أيقونة

source: Close
ar: إغلاق

source: Amount
ar: المبلغ

source: Date
ar: التاريخ

source: Select Date
ar: اختر التاريخ

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Today
ar: اليوم

source: Yesterday
ar: الأمس

source: Delete
ar: حذف

# deleteDialogTitle
source: Delete Confirmation
ar: تأكيد الحذف

# deleteDialogContent
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد الحذف؟

# deleteStateSuccess
source: Delete Success
ar: تم الحذف بنجاح

# deleteStateFailure
source: Delete Failure
ar: فشلت عملية الحذف

# editStateSuccess
source: Editing Success
ar: تم التعديل بنجاح

source: Search Options
ar: خيارات البحث

source: Clear Filter Data
ar: مسح بيانات الفلتر

source: Category Type
ar: نوع الفئة

source: All
ar: الكل

source: Income
ar: الدخل

source: Expense
ar: المصروفات

# emptyList
source: No items available
ar: لا توجد عناصر متاحة

source: Apply
ar: تطبيق

# cancle
source: Cancel
ar: إلغاء

source: Save Changes
ar: حفظ التغييرات

# pickImageTitle
source: Tap to Change Profile Image
ar: اضغط لتغيير صورة الملف الشخصي

# changeImageSuccess
source: Image changed successfully
ar: تم تغيير الصورة بنجاح

# saveChangesSuccess
source: Changes saved successfully
ar: تم حفظ التغييرات بنجاح

source: Save
ar: حفظ

# addStartCurrentBalanceTitle
source: Your Current Balance
ar: رصيدك الحالي

# addStartCurrentBalanceSubtitle
source: Before you start, would you like to add the money you currently have?
ar: قبل ما تبدأ, حابب تضيف الفلوس اللي معاك دلوقتي ؟

# addStartCurrentBalanceHint
source: Enter your current balance
ar: أدخل رصيدك الحالي

# appTitle
source: Daftarni
ar: دفترني

source: Skip
ar: تخطي

source: Next
ar: التالي

# onBoardingTitle1
source: Welcome to Budget Planner
ar: مرحبًا بك في مخطط الميزانية

# onBoardingSubTitle1
source: Take control of your money and save by tracking your expenses
ar: تحكم في أموالك وادخر من خلال تتبع نفقاتك

# onBoardingTitle2
source: Save money easily
ar: وفر المال بسهولة

# onBoardingSubTitle2
source: Create budgets easily and see our suggestions based on your spending
ar: قم بإنشاء ميزانيات بسهولة وشاهد اقتراحاتنا بناءً على إنفاقك

# onBoardingTitle3
source: Track your bills like never before
ar: تتبع فواتيرك كما لم يحدث من قبل

# onBoardingSubTitle3
source: Build a custom budget based on your income, bills, and goals
ar: قم بإنشاء ميزانية مخصصة بناءً على دخلك وفواتيرك وأهدافك

source: Get Started
ar: ابدأ الآن

# configureYourInfo
source: Configure your information
ar: قم بإضافة معلوماتك

source: User Name
ar: اسم المستخدم

# userNameHint
source: Enter your user name
ar: أدخل اسم المستخدم الخاص بك

source: Salary
ar: الراتب

# salaryHint
source: Enter your monthly salary
ar: أدخل راتبك الشهري

source: Salary Day
ar: يوم الراتب

# salaryDayHint
source: Enter your salary day
ar: أدخل يوم راتبك

# sideIncomeHint
source: Enter your side income
ar: أدخل دخلك الجانبي

source: --- App Settings ---
ar: --- إعدادات التطبيق ---

source: Light Theme
ar: الوضع الفاتح

source: Dark Theme
ar: الوضع الداكن

source: System Theme
ar: وضع النظام

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

# continueButton
source: Continue
ar: استمر

source: Hi
ar: مرحبًا

source: Welcome Back
ar: مرحبًا بعودتك

source: Current Balance
ar: الرصيد الحالي

# viewDetailedReport
source: View Monthly Report
ar: عرض التقرير الشهري

source: Quick Actions
ar: الإجراءات السريعة

source: Add New Expense
ar: إضافة مصروف جديد

source: Record Income
ar: تسجيل دخل

source: Transactions Analysis
ar: تحليل العمليات

source: Manage Categories
ar: إدارة الفئات

source: Recent Transactions
ar: العمليات الأخيرة

source: View All
ar: عرض الكل

source: Category
ar: الفئة

source: Choose Category
ar: اختر الفئة

source: Notes (Optional)
ar: ملاحظات (اختياري)

# addExpenseTitle
source: Add Expense
ar: إضافة مصروف

# addExpenseSubTitle
source: Manage your spendings smartly
ar: إدارة مصاريفك بذكاء

source: Enter Expense Amount
ar: أدخل مبلغ المصروف

# notesExpenseBrief
source: Add a brief description or note about this expense ...
ar: أضف وصفًا موجزًا أو ملاحظة حول هذا المصروف ...

# addExpenseButton
source: ✨ Add Expense
ar: ✨ إضافة مصروف

# addIncomeTitle
source: Add Income
ar: إضافة دخل

# addIncomeSubTitle
source: Track your earnings efficiently
ar: تتبع أرباحك بكفاءة

source: Enter Income Amount
ar: أدخل مبلغ الدخل

# notesIncomeBrief
source: Add a brief description or note about this income ...
ar: أضف وصفًا موجزًا أو ملاحظة حول هذا الدخل ...

# addIncomeButton
source: ✨ Add Income
ar: ✨ إضافة دخل

# addTransactionSuccess
source: Transaction added successfully
ar: تمت إضافة المعاملة بنجاح

# addExpenseTransactionLowValue
source: Insufficient Funds for this expense
ar: المصروف يتجاوز الرصيد الحالي

# editIncomeTitle
source: Edit Income
ar: تعديل الدخل

# editIncomeButton
source: ✨ Edit Income
ar: ✨ تعديل الدخل

# editExpenseTitle
source: Edit Expense
ar: تعديل المصروف

# editExpenseButton
source: ✨ Edit Expense
ar: ✨ تعديل المصروف

source: Categories
ar: الفئات

# categoriesSearchHint
source: Search Categories ...
ar: ابحث في الفئات ...

source: Add New Category
ar: إضافة فئة جديدة

# addNewCategorySubtitle
source: Create a custom category for better expense tracking
ar: قم بإنشاء فئة مخصصة لتتبع النفقات بشكل أفضل

source: Category Name
ar: اسم الفئة

# categoryNameHint
source: e.g., Groceries, Transport, Rent ...
ar: مثال: بقالة، نقل، إيجار ...

source: Category Icon
ar: أيقونة الفئة

source: Selected Icon :
ar: الأيقونة المحددة :

# categoryIconHint
source: Tap to select an icon
ar: اضغط لاختيار أيقونة

source: Category Color
ar: لون الفئة

# categoryColorHint
source: Tap to choose a color
ar: اضغط لاختيار لون

# createCategoryButton
source: ✨ Create Category
ar: ✨ إنشاء فئة

# addCategorySuccess
source: Category added successfully
ar: تمت إضافة الفئة بنجاح

source: Transactions
ar: العمليات

# transactionsSearchHint
source: Search Transactions ...
ar: ابحث في العمليات ...

source: Balance Analysis
ar: تحليل الرصيد

source: Notes
ar: الملاحظات

source: Total
ar: المجموع

source: No data available
ar: لا توجد بيانات متاحة

# monthlyReportButton
source: View Monthly Report
ar: عرض التقرير الشهري

# monthlyReportViewTitle
source: Monthly Transactions Report
ar: تقرير العمليات الشهري

# monthlyReportTitle
source: Monthly Transactions Report for
ar: تقرير العمليات الشهرية لـ

# analysisReportViewTitle
source: Transactions Report
ar: تحليل العمليات

# analysisReportTitle
source: Transactions Analysis Report
ar: تقرير تحليل العمليات

source: From
ar: من

source: To
ar: إلى

source: Settings
ar: الإعدادات

source: Not Signed In
ar: غير مسجل الدخول

source: Personal
ar: شخصية

# personalInfo
source: Personal Information
ar: معلومات شخصية

source: General
ar: عامة

source: Notifications
ar: الإشعارات

# notificationsHint
source: Manage your notification
ar: إدارة تفضيلات الاشعارات

source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyHint
source: Review our privacy practices
ar: راجع ممارسات الخصوصية

source: Support
ar: الدعم

# supportHint
source: Get help and support
ar: احصل على المساعدة والدعم

# privacySecurityTitle
source: Privacy and Security
ar: الخصوصية والأمان

# privacyPolicySubtitle
source: Read our privacy policy
ar: اقرأ سياسة الخصوصية الخاصة بنا

# privacySecurityIntro
source: We at the Expense Manager app value your privacy and the security of your financial and personal data. By using the app, you agree to the following privacy policy:
ar: نحن في تطبيق مدير النفقات نقدر خصوصيتك وأمان بياناتك المالية والشخصية. باستخدام التطبيق، فإنك توافق على سياسة الخصوصية التالية:

# privacySecurityFirstTitle
source: 1. Data We Collect
ar: 1. البيانات التي نجمعها

# privacySecurityFirstText
source: • Information you manually enter into the app (such as expenses, categories, income...) • User account information (name, email, password) if you create an account. • We do not collect any other data without your knowledge or consent.
ar: • المعلومات التي تدخلها يدويًا في التطبيق (مثل النفقات، الفئات، الدخل...) • معلومات حساب المستخدم (الاسم، البريد الإلكتروني، كلمة المرور) إذا قمت بإنشاء حساب. • نحن لا نجمع أي بيانات أخرى بدون علمك أو موافقتك.

# privacySecuritySecondTitle
source: 2. Data Storage Location
ar: 2. موقع تخزين البيانات

# privacySecuritySecondText
source: • If you don’t have an account: your data is stored locally on your device only. • If you create an account: a secure copy of your data is stored online to enable synchronization and recovery from other devices. • Data is encrypted during transfer and storage for your safety.
ar: • إذا لم يكن لديك حساب: يتم تخزين بياناتك محليًا على جهازك فقط. • إذا قمت بإنشاء حساب: يتم تخزين نسخة آمنة من بياناتك عبر الإنترنت لتمكين المزامنة والاسترداد من أجهزة أخرى. • يتم تشفير البيانات أثناء النقل والتخزين من أجل سلامتك.

# privacySecurityThirdTitle
source: 3. How We Use Data
ar: 3. كيفية استخدامنا للبيانات الخاصة بك

# privacySecurityThirdText
source: • Your data is only used to display and manage your personal expenses. • We do not share your data with third parties. • We do not use your data for advertising or marketing purposes.
ar: • يتم استخدام بياناتك فقط لعرض وإدارة نفقاتك الشخصية. • نحن لا نشارك بياناتك مع أطراف ثالثة. • نحن لا نستخدم بياناتك لأغراض الإعلان أو التسويق.

# privacySecurityFourthTitle
source: 4. Security
ar: 4. الأمان

# privacySecurityFourthText
source: • All stored data, locally or on the server, is protected using encryption technologies. • You can change your password anytime from account settings. • You can permanently delete your account and all related data. • App access can be protected using a PIN or fingerprint (if supported).
ar: • يتم حماية جميع البيانات المخزنة، محليًا أو على الخادم، باستخدام تقنيات التشفير. • يمكنك تغيير كلمة المرور في أي وقت من إعدادات الحساب. • يمكنك حذف حسابك وجميع البيانات المرتبطة به بشكل دائم. • يمكن حماية الوصول إلى التطبيق باستخدام رمز PIN أو بصمة الإصبع (إذا كان مدعومًا).

# privacySecurityFifthTitle
source: 5. User Rights
ar: 5. حقوق المستخدم

# privacySecurityFifthText
source: • You have full rights to access, modify, or delete your data. • You can use the 'Delete Account' feature to permanently erase all data from the app and the server.
ar: • لديك كامل الحقوق للوصول إلى بياناتك وتعديلها أو حذفها. • يمكنك استخدام ميزة 'حذف الحساب' لمحو جميع البيانات من التطبيق والخادم بشكل دائم.

# privacySecurityContactTitle
source: Contact
ar: اتصل بنا

# privacySecurityContactText
source: If you have any questions regarding privacy or security, you can contact us via email: support@yourapp.com
ar: إذا كان لديك أي أسئلة بخصوص الخصوصية أو الأمان، يمكنك الاتصال بنا عبر البريد الإلكتروني: support@yourapp.com

# privacySecurityFooter
source: Daftarny Expense Manager. All rights reserved
ar: مدير نفقات دفترني. جميع الحقوق محفوظة

# contactUsTitle
source: Contact Us
ar: اتصل بنا

# contactUsHint
source: For assistance, please reach out to our support team
ar: للمساعدة، يرجى التواصل مع فريق الدعم الخاص بنا

# supportPhoneTitle
source: Phone Call
ar: مكالمة هاتفية

# supportPhoneHint
source: Press to call the support team
ar: اضغط للاتصال بفريق الدعم

# supportWhatsappTitle
source: WhatsApp
ar: واتساب

# supportWhatsappHint
source: Press to chat with the support team on WhatsApp
ar: اضغط للدردشة مع فريق الدعم على واتساب

# supportEmailTitle
source: Email Support
ar: البريد الإلكتروني

# supportEmailHint
source: Press to send an email to the support team
ar: اضغط لإرسال بريد إلكتروني إلى فريق الدعم

# faqTitle
source: ----- Frequently Asked Questions -----
ar: ----- الأسئلة المتكررة -----

# faqQuestion1
source: How can I restore my data after deleting the app?
ar: كيف يمكنني استعادة بياناتي بعد حذف التطبيق؟

# faqAnswer1
source: You can restore your data by logging back into your account using the same email and password.
ar: يمكنك استعادة بياناتك عن طريق تسجيل الدخول مرة أخرى إلى حسابك باستخدام نفس البريد الإلكتروني وكلمة المرور.

# faqQuestion2
source: Can I use the app without creating an account?
ar: هل يمكنني استخدام التطبيق بدون إنشاء حساب؟

# faqAnswer2
source: Yes, you can use the app without an account, but your data will be saved only on your device.
ar: نعم، يمكنك استخدام التطبيق بدون حساب، ولكن سيتم حفظ بياناتك فقط على جهازك.

# faqQuestion3
source: Can I permanently delete my account?
ar: هل يمكنني حذف حسابي نهائيًا؟

# faqAnswer3
source: Yes, you can delete your account and all your data from Settings > Delete Account.
ar: نعم، يمكنك حذف حسابك وجميع بياناتك من الإعدادات > حذف الحساب.
